function X=NewtonN(F,x0,N,Ex)
if nargin<4
    Ex=1e-10;
    if nargin<3
        N=1;
    end
end
error=1;
k=1;
h=1e-2;
if N==3
    F1=zeros(N,N);
    while error>Ex
        F1(:,1)=(F(x0(1)+h,x0(2),x0(3))-F(x0(1),x0(2),x0(3)))./h;
        F1(:,2)=(F(x0(1),x0(2)+h,x0(3))-F(x0(1),x0(2),x0(3)))./h;
        F1(:,3)=(F(x0(1),x0(2),x0(3)+h)-F(x0(1),x0(2),x0(3)))./h;
      
        x1=x0-F1\F(x0(1),x0(2),x0(3));
        error=norm(F(x1(1),x1(2),x1(3)));
        k=k+1;
        if k>=20
            str='这个三维的解没找到    > — <'

            break
        end
        x0=x1;
    end
    X=x1;
end
if N==6
    F1=zeros(N,N);
    while error>Ex
        F1(:,1)=(  F(x0(1)+h,x0(2),x0(3),x0(4),x0(5),x0(6))-F(x0(1),x0(2),x0(3),x0(4),x0(5),x0(6))  )./h;
        F1(:,2)=(  F(x0(1),x0(2)+h,x0(3),x0(4),x0(5),x0(6))-F(x0(1),x0(2),x0(3),x0(4),x0(5),x0(6))  )./h;
        F1(:,3)=(  F(x0(1),x0(2),x0(3)+h,x0(4),x0(5),x0(6))-F(x0(1),x0(2),x0(3),x0(4),x0(5),x0(6))  )./h;
        F1(:,4)=(  F(x0(1),x0(2),x0(3),x0(4)+h,x0(5),x0(6))-F(x0(1),x0(2),x0(3),x0(4),x0(5),x0(6))  )./h;
        F1(:,5)=(  F(x0(1),x0(2),x0(3),x0(4),x0(5)+h,x0(6))-F(x0(1),x0(2),x0(3),x0(4),x0(5),x0(6))  )./h;
        F1(:,6)=(  F(x0(1),x0(2),x0(3),x0(4),x0(5),x0(6)+h)-F(x0(1),x0(2),x0(3),x0(4),x0(5),x0(6))  )./h;
        x1=x0-F1\F(x0(1),x0(2),x0(3),x0(4),x0(5),x0(6));
        error=norm(F(x1(1),x1(2),x1(3),x1(4),x1(5),x1(6)));
        k=k+1;
        if k>=20
            str='这个六位的解没找到    > — <'

            break
        end
        x0=x1;
    end
    X=x1;
end

